rm unwanted updates
Signed-off-by: Ananth Subramaniam <ansubramania@nvidia.com>
